app/controllers/registrations_controller.rb

SELECT * FROM `registrations` WHERE (`registrations`.`id` = 15)
---
  def show
    @registration = Registration.find(params[:id])